lv_cfd_patient/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2.4;
deltaT          0.0005;
writeControl    adjustableRunTime;
writeInterval   0.04;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

adjustTimeStep  yes;
maxCo           1.0;
maxDeltaT       0.001;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            U { mean on; prime2Mean on; base time; }
            p { mean on; prime2Mean on; base time; }
        );
    }

    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (walls bottom);
    }

    forces1
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   20;
        patches         (walls bottom);
        rho             rhoInf;
        rhoInf          1060;
        CofR            (0.023339 0.036979 0.021783);
    }

    flowRateMitral
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   10;
        surfaceFormat   none;
        regionType      patch;
        writeFields     false;
        name            inlet;
        operation       sum;
        fields          (phi);
    }

    flowRateAortic
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   10;
        surfaceFormat   none;
        regionType      patch;
        writeFields     false;
        name            outlet;
        operation       sum;
        fields          (phi);
    }

    probes1
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   5;
        fields          (U p);
        probeLocations
        (
            (0.023339 0.036979 0.021783)   // LV center
            (0.009336 0.066563 0.021783)   // Near mitral (inlet)
            (0.037342 0.066563 0.021783)   // Near aortic (outlet)
        );
    }
}
