lv_cfd_patient/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name            inlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set             inletFaces;
    }
    {
        name            outlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set             outletFaces;
    }
);
