lv_cfd_patient/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // Mitral valve — area-corrected pulsatile profile
        // Real MV area = 2.8 cm², mesh inlet face ~ 8.23 cm²
        // Velocity scaled by 0.340 to preserve flow rate
        // Peak E-wave: 0.272 m/s (real: 0.8 m/s)
        // Flow in -y direction (from valve plane toward apex)
        type            uniformFixedValue;
        uniformValue    table
        (
(0.0000 (0 -0.036835 0))
            (0.0050 (0 -0.044766 0))
            (0.0100 (0 -0.053863 0))
            (0.0150 (0 -0.064164 0))
            (0.0200 (0 -0.075675 0))
            (0.0250 (0 -0.088362 0))
            (0.0300 (0 -0.102150 0))
            (0.0350 (0 -0.116915 0))
            (0.0400 (0 -0.132482 0))
            (0.0450 (0 -0.148628 0))
            (0.0500 (0 -0.165082 0))
            (0.0550 (0 -0.181534 0))
            (0.0600 (0 -0.197640 0))
            (0.0650 (0 -0.213033 0))
            (0.0700 (0 -0.227340 0))
            (0.0750 (0 -0.240194 0))
            (0.0800 (0 -0.251249 0))
            (0.0850 (0 -0.260199 0))
            (0.0900 (0 -0.266786 0))
            (0.0950 (0 -0.270817 0))
            (0.1000 (0 -0.272175 0))
            (0.1050 (0 -0.270817 0))
            (0.1100 (0 -0.266786 0))
            (0.1150 (0 -0.260199 0))
            (0.1200 (0 -0.251249 0))
            (0.1250 (0 -0.240194 0))
            (0.1300 (0 -0.227340 0))
            (0.1350 (0 -0.213033 0))
            (0.1400 (0 -0.197640 0))
            (0.1450 (0 -0.181534 0))
            (0.1500 (0 -0.165082 0))
            (0.1550 (0 -0.148628 0))
            (0.1600 (0 -0.132482 0))
            (0.1650 (0 -0.116915 0))
            (0.1700 (0 -0.102150 0))
            (0.1750 (0 -0.088362 0))
            (0.1800 (0 -0.075675 0))
            (0.1850 (0 -0.064164 0))
            (0.1900 (0 -0.053863 0))
            (0.1950 (0 -0.044766 0))
            (0.2000 (0 -0.017011 0))
            (0.2050 (0 -0.017011 0))
            (0.2100 (0 -0.017011 0))
            (0.2150 (0 -0.017011 0))
            (0.2200 (0 -0.017011 0))
            (0.2250 (0 -0.017011 0))
            (0.2300 (0 -0.017011 0))
            (0.2350 (0 -0.017011 0))
            (0.2400 (0 -0.017011 0))
            (0.2450 (0 -0.017011 0))
            (0.2500 (0 -0.017011 0))
            (0.2550 (0 -0.017011 0))
            (0.2600 (0 -0.017011 0))
            (0.2650 (0 -0.017011 0))
            (0.2700 (0 -0.017011 0))
            (0.2750 (0 -0.017011 0))
            (0.2800 (0 -0.017011 0))
            (0.2850 (0 -0.017011 0))
            (0.2900 (0 -0.017011 0))
            (0.2950 (0 -0.017011 0))
            (0.3000 (0 -0.023464 0))
            (0.3050 (0 -0.029431 0))
            (0.3100 (0 -0.036342 0))
            (0.3150 (0 -0.044181 0))
            (0.3200 (0 -0.052878 0))
            (0.3250 (0 -0.062305 0))
            (0.3300 (0 -0.072276 0))
            (0.3350 (0 -0.082541 0))
            (0.3400 (0 -0.092804 0))
            (0.3450 (0 -0.102724 0))
            (0.3500 (0 -0.111943 0))
            (0.3550 (0 -0.120097 0))
            (0.3600 (0 -0.126847 0))
            (0.3650 (0 -0.131901 0))
            (0.3700 (0 -0.135028 0))
            (0.3750 (0 -0.136087 0))
            (0.3800 (0 -0.135028 0))
            (0.3850 (0 -0.131901 0))
            (0.3900 (0 -0.126847 0))
            (0.3950 (0 -0.120097 0))
            (0.4000 (0 -0.111943 0))
            (0.4050 (0 -0.102724 0))
            (0.4100 (0 -0.092804 0))
            (0.4150 (0 -0.082541 0))
            (0.4200 (0 -0.072276 0))
            (0.4250 (0 -0.062305 0))
            (0.4300 (0 -0.052878 0))
            (0.4350 (0 -0.044181 0))
            (0.4400 (0 -0.036342 0))
            (0.4450 (0 -0.029431 0))
            (0.4500 (0 -0.000000 0))
            (0.4550 (0 -0.000000 0))
            (0.4600 (0 -0.000000 0))
            (0.4650 (0 -0.000000 0))
            (0.4700 (0 -0.000000 0))
            (0.4750 (0 -0.000000 0))
            (0.4800 (0 -0.000000 0))
            (0.4850 (0 -0.000000 0))
            (0.4900 (0 -0.000000 0))
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        // Inter-valve wall region (remaining top face after patch split)
        type            noSlip;
    }

    bottom
    {
        // LV apex
        type            noSlip;
    }

    walls
    {
        type            noSlip;
    }
}
