lv_cfd_patient/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        // Aortic valve — pressure reference
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        // Inter-valve wall
        type            zeroGradient;
    }

    bottom
    {
        // LV apex
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }
}
